
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        3 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢    | `module.infrahouse_com.aws_route53_record.amazonses_verification_record`  |
|    🟢    | `module.infrahouse_com.aws_ses_domain_identity.ses_domain`                |
|    🟢    | `module.infrahouse_com.aws_ses_domain_identity_verification.verification` |
|    🟡    | `aws_iam_policy.emailer`                                                  |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.emailer-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "emailer-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
              + "ses:SendRawEmail",
            ]
          + resources = [
              + "arn:aws:ses:us-west-1:493370826424:identity/twindb.com",
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.emailer will be updated in-place
  ~ resource "aws_iam_policy" "emailer" {
        id               = "arn:aws:iam::493370826424:policy/production-emailer"
        name             = "production-emailer"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ses:SendRawEmail",
                          - "ses:SendEmail",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ses:us-west-1:493370826424:identity/twindb.com"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.infrahouse_com.aws_route53_record.amazonses_verification_record will be created
  + resource "aws_route53_record" "amazonses_verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.infrahouse.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.infrahouse_com.aws_ses_domain_identity.ses_domain will be created
  + resource "aws_ses_domain_identity" "ses_domain" {
      + arn                = (known after apply)
      + domain             = "infrahouse.com"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # module.infrahouse_com.aws_ses_domain_identity_verification.verification will be created
  + resource "aws_ses_domain_identity_verification" "verification" {
      + arn    = (known after apply)
      + domain = "infrahouse.com"
      + id     = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDMsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDB9fQ==
```
</details>